# Создать список и заполнить его элементами различных типов данных.
data_list = ["some_string", 12, 12.3, None, True, [1, 2, 3], {1: 2, 3: 4, 5: 6}, (1, 2, 3), set((1, 2, 3))]
for elem in data_list: print(type(elem))